Vimalananth/STM32-EC200-Firmware/src/modem.c
/*
 * modem.c  —  EC200U MQTT driver for STM32G071 (PlatformIO / STM32Cube HAL)
 *
 * Replaces the SMS-based relay control with MQTT over 4G LTE.
 *
 * UART wiring (from your stm32g0xx_hal_msp.c):
 *   USART1  PB6=TX  PB7=RX  →  EC200U
 *   USART2  PA2=TX  PA3=RX  →  debug serial monitor (115200)
 *
 * HiveMQ Cloud broker  :  44ad82d486654d68b4ac738e12fb1236.s1.eu.hivemq.cloud:8883
 * Firebase project     :  pump-controller-4398d
 *
 * MQTT topics  (PUMP_ID = "01" for pump 1, "02" for pump 2):
 *   pump/01/status   ← STM32 publishes on state change / 60 s heartbeat
 *   pump/01/alerts   ← STM32 publishes on protection trip
 *   pump/01/cmd      → STM32 subscribes (relay on/off commands)
 *
 * Payload examples:
 *   status : {"relay1_state":1,"relay2_state":0,"v1":415.2,"v2":414.8,
 *              "v3":416.1,"current":12.4,"dry_run":false,"online":true}
 *   cmd    : {"relay1":1,"relay2":0}
 *   alerts : {"overvoltage":false,"undervoltage":false,
 *              "phase_loss":false,"dry_run_trip":true}
 */

#include "modem.h"
#include "modbus.h"
#include "main.h"
#include "ota.h"
#include "lora.h"
#include "lora_ota.h"
#include <string.h>
#include <stdio.h>
#include <stdlib.h>

/* IWDG handle lives in main.c — refresh it inside long blocking delays */
extern IWDG_HandleTypeDef hiwdg;

extern volatile uint8_t g_boot_phase;
extern const char g_fw_ver[];

/* ═══════════════════════════════════════════════════════════════════════════
 * USER CONFIG  —  change these two lines per device before flashing
 * ═══════════════════════════════════════════════════════════════════════════ */
/* PUMP_ID / PUMP_ID2 — defined in modem.h, change there before flashing */
#define MQTT_USERNAME ""             /* anonymous — broker.emqx.io         */
#define MQTT_PASSWORD ""
/* SMS remote-control trusted sender — set to "+91XXXXXXXXXX" to restrict;
 * leave "" to accept STATUS/RESET commands from ANY sender.               */
#define SMS_TRUSTED_NUMBER ""

/* ── APN — change to your SIM card ─────────────────────────────────────── */
/* Airtel: "airtelgprs.com"   Jio: "jionet"   BSNL: "bsnlnet"             */
#define SIM_APN "airtelgprs.com"

/* ── Broker ─────────────────────────────────────────────────────────────── */
#define BROKER_HOST "broker.emqx.io"
#define BROKER_PORT "8883"
#define CLIENT_ID "pump" PUMP_ID

/* ── Topics ─────────────────────────────────────────────────────────────── */
#define TOPIC_STATUS   "pump/" PUMP_ID "/status"
#define TOPIC_CMD      "pump/" PUMP_ID "/cmd"
#define TOPIC_ALERTS   "pump/" PUMP_ID "/alerts"
#define TOPIC_OTA        "pump/" PUMP_ID "/ota"
#define TOPIC_OTA_STATUS "pump/" PUMP_ID "/ota/status"
#define TOPIC_SETTINGS "pump/" PUMP_ID "/settings"
#define TOPIC_LOG        "pump/" PUMP_ID "/log"
#define TOPIC_SLAVE_STATUS "pump/" PUMP_ID "/slave_status" /* LoRa slave live status (set) */
#define TOPIC_SLAVE_VLOG   "pump/" PUMP_ID "/slave_vlog"   /* LoRa slave voltage log (push) */
#define TOPIC_LORA_OTA   "pump/" PUMP_ID "/lora_ota"  /* Blue Pill OTA trigger URL */
/* relay2 — same STM32, topics derived from PUMP_ID2 */
#define TOPIC_CMD2       "pump/" PUMP_ID2 "/cmd"
#define TOPIC_STATUS2    "pump/" PUMP_ID2 "/status"
#define TOPIC_ALERTS2    "pump/" PUMP_ID2 "/alerts"
#define TOPIC_LOG2       "pump/" PUMP_ID2 "/log"
#define TOPIC_SETTINGS2  "pump/" PUMP_ID2 "/settings"

/* ── Protection thresholds — runtime configurable via TOPIC_SETTINGS ─────── */
static float cfg_ov    = 480.0f; /* V  — any L-N above this trips relay    */
static float cfg_uv    = 340.0f; /* V  — any L-N below this trips relay    */
static float cfg_pl    = 200.0f; /* V  — L-N below this = phase lost       */
static float cfg_dry_i = 1.5f;   /* A  — below this = dry running (relay1) */
static int   cfg_dry_t = 8;      /* s  — consecutive seconds before trip   */
static int   cfg_hp     = 0;     /* pump rating: 5=5HP 75=7.5HP 0=custom   */
static int   cfg_dry_en  = 1;   /* 1=dry-run enabled  0=disabled           */
static int   cfg_start_t = 300; /* s  — startup grace: skip dry-run count  */
static int   cfg_uv_restart_t = 300; /* s — 0=disabled; default 5 min; overridden by MQTT settings */
/* ── Relay2-specific settings (dry_i/dry_t/dry_en/hp only — voltage shared) */
static float cfg_dry_i2  = 1.5f; /* A  — dry run threshold for relay2      */
static int   cfg_dry_t2  = 8;    /* s  — dry run delay for relay2          */
static int   cfg_dry_en2 = 1;    /* 1=dry-run enabled for relay2            */
static int   cfg_hp2     = 0;    /* relay2 pump rating                       */
static int   cfg_start_t2 = 300; /* s  — startup grace for relay2           */
#define LOCKOUT_MS 300000UL       /* 5 min lockout after dry-run trip       */
/* Minimum current to consider the motor actually running.
 * If i < this threshold the motor is completely de-energised (external
 * preventer/timer has opened the contactor) — not a dry-run condition.
 * Dry-run only counts when the motor IS spinning but drawing low current. */
#define DRY_RUN_MIN_I_A  0.3f

/* ── Heartbeat interval (event-driven: also publish on every state change) ── */
#define HEARTBEAT_INTERVAL_MS 10000UL   /* publish status every 10 s */
#define LORA_LOG_INTERVAL_MS  60000UL   /* LoRa heartbeat log every 1 min */
/* QoS0 PUBEX acks can arrive late when modem/network is busy. */
#define MQTT_PUBACK_TIMEOUT_MS 12000UL
#define OTA_POST_QMTCLOSE_DELAY_MS 8000UL
#define OTA_HTTP_REDIRECT_ENABLED 0  /* firmware served from Railway — no redirect */
/* Block immediate OTA retrigger for a while after modem reboot during OTA.
 * This avoids retained pump/01/ota payload causing endless retry loops. */
#define OTA_RETRY_BLOCK_MS 300000UL
/* Raw line tracing is very chatty and can starve UART servicing at 9600 debug. */
#define MODEM_TRACE_LINES 0

/* ── RX buffer ──────────────────────────────────────────────────────────── */
#define RX_BUF_SIZE 512

/* ═══════════════════════════════════════════════════════════════════════════
 * Internal state
 * ═══════════════════════════════════════════════════════════════════════════ */

