Vimalananth/STM32-EC200-Firmware/src/modem.c
void Relay2_Set(bool on)
{
    relay2 = on;
    if (on) {
        HAL_GPIO_WritePin(Relay2_Pin_GPIO_Port, Relay2_Pin_Pin, GPIO_PIN_SET);   /* PB4 HIGH — SET coil pulse start  */
        HAL_Delay(200);
        HAL_GPIO_WritePin(Relay2_Pin_GPIO_Port, Relay2_Pin_Pin, GPIO_PIN_RESET); /* PB4 LOW  — SET coil pulse end    */
    } else {
        HAL_GPIO_WritePin(Relay2_RST_GPIO_Port, Relay2_RST_Pin, GPIO_PIN_SET);   /* PB5 HIGH — RESET coil pulse start */
        HAL_Delay(200);
        HAL_GPIO_WritePin(Relay2_RST_GPIO_Port, Relay2_RST_Pin, GPIO_PIN_RESET); /* PB5 LOW  — RESET coil pulse end   */
    }
}

static void blink_n(int n)
{
    /* PA1 is now RESET coil — cannot use for diagnostic blink (would unlatch relay) */
    (void)n;
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Network RTC helpers
 * ═══════════════════════════════════════════════════════════════════════════ */

static bool rtc_is_leap(int y)
{
    return (y % 4 == 0 && y % 100 != 0) || (y % 400 == 0);
}

/* Days before each month in a non-leap year */
static const uint16_t k_mdays[12] = {0,31,59,90,120,151,181,212,243,273,304,334};

/* Convert AT+CCLK fields to UTC Unix milliseconds.
 * yy     : 2-digit year (e.g. 26 → 2026)
 * tz_qh  : timezone offset in quarter-hours (+22 = IST +5:30) */
static uint64_t cclk_to_unix_ms(int yy, int mo, int dd,
                                 int hh, int mm, int ss, int tz_qh)
{
    int year = 2000 + yy;
    /* Days from 1970-01-01 to year-01-01 using proleptic Gregorian calendar */
    int y = year - 1;
    long days = (long)y * 365L + (long)(y / 4) - (long)(y / 100) + (long)(y / 400)
              - 719162L; /* pre-computed offset for 1969: 1969*365+492-19+4 */
    /* Days within the year */
    days += k_mdays[mo - 1];
    if (mo > 2 && rtc_is_leap(year)) days++;
    days += dd - 1;
    /* Local seconds since epoch, then subtract tz offset to get UTC */
    int64_t utc_s = (int64_t)days * 86400LL
                  + (int64_t)hh * 3600LL + (int64_t)mm * 60LL + (int64_t)ss
                  - (int64_t)tz_qh * 15LL * 60LL;
    return (uint64_t)(utc_s * 1000LL);
}

/* Parse "+CCLK: \"26/05/21,10:30:00+22\"" and update rtc_unix_ms */
static void parse_cclk_line(const char *line)
{
    const char *p = strstr(line, "+CCLK:");
    if (!p) return;
    p += 6;
    while (*p == ' ') p++;
    if (*p == '"') p++;
    int yy = 0, mo = 0, dd = 0, hh = 0, mm = 0, ss = 0, tz = 0;
    if (sscanf(p, "%d/%d/%d,%d:%d:%d%d", &yy, &mo, &dd, &hh, &mm, &ss, &tz) < 6)
        return;
    if (yy < 24 || mo < 1 || mo > 12 || dd < 1 || dd > 31) return; /* sanity */
    rtc_unix_ms   = cclk_to_unix_ms(yy, mo, dd, hh, mm, ss, tz);
    rtc_tick_base = HAL_GetTick();
    last_cclk_ms  = rtc_tick_base;
    Debug_Print("[RTC] Network time synced\r\n");
}

/* Public getter — returns 0 until first sync */
uint64_t Modem_GetUnixMs(void)
{
    if (!rtc_unix_ms) return 0;
    return rtc_unix_ms + (uint64_t)(HAL_GetTick() - rtc_tick_base);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Connection status
 * ═══════════════════════════════════════════════════════════════════════════ */

bool Modem_IsConnected(void)
{
    return mqtt_state == MQTT_STATE_CONNECTED;
}

bool Relay1_Get(void) { return relay1; }
bool Relay2_Get(void) { return relay2; }

/* ═══════════════════════════════════════════════════════════════════════════
 * Sensor stubs
 * Override these in a separate sensors.c once you wire up ADC channels.
 * Until then they return safe dummy values so the MQTT loop works.
 * ═══════════════════════════════════════════════════════════════════════════ */

__attribute__((weak)) float Sensor_ReadVoltagePhase1(void) { return 415.0f; }
__attribute__((weak)) float Sensor_ReadVoltagePhase2(void) { return 415.0f; }
__attribute__((weak)) float Sensor_ReadVoltagePhase3(void) { return 415.0f; }
__attribute__((weak)) float Sensor_ReadCurrentACS712(void) { return 5.0f; }

/* ═══════════════════════════════════════════════════════════════════════════
 * MQTT publish helpers
 * ═══════════════════════════════════════════════════════════════════════════ */

static void queue_publish(const char *topic, const char *payload)
{
    if (pub_pending)
        return; /* drop if previous not sent yet      */

    strncpy(pub_topic, topic, sizeof(pub_topic) - 1);
    strncpy(pub_payload, payload, sizeof(pub_payload) - 1);
    pub_topic[sizeof(pub_topic) - 1] = '\0';
    pub_payload[sizeof(pub_payload) - 1] = '\0';
    pub_pending = true;
}

/* Format float to 1 decimal place without requiring -u_printf_float.
 * Handles negative values and clamps out-of-range to "0.0".           */
static void fmt_f1(char *out, int sz, float v)
{
    if (v != v || v > 99999.0f || v < -9999.0f) { snprintf(out, sz, "0.0"); return; }
    int neg = (v < 0.0f);
    float a = neg ? -v : v;
    int   w = (int)a;
    int   d = (int)((a - (float)w) * 10.0f);
    if (neg) snprintf(out, sz, "-%d.%d",  w, d);
    else     snprintf(out, sz,  "%d.%d",  w, d);
}

static void fmt_f2(char *out, int sz, float v)
{
    if (v != v || v > 9999.0f || v < -999.0f) { snprintf(out, sz, "0.00"); return; }
    int neg = (v < 0.0f);
    float a = neg ? -v : v;
    int   w = (int)a;
    int   d = (int)((a - (float)w) * 100.0f);
    if (neg) snprintf(out, sz, "-%d.%02d", w, d);
    else     snprintf(out, sz,  "%d.%02d", w, d);
}

static void publish_status(void)
{
    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    float i  = Sensor_ReadCurrentACS712();

    char sv1[12], sv2[12], sv3[12], sci[12], skw[10];
    fmt_f1(sv1, sizeof(sv1), v1);
    fmt_f1(sv2, sizeof(sv2), v2);
    fmt_f1(sv3, sizeof(sv3), v3);
    fmt_f2(sci, sizeof(sci), i);
    fmt_f2(skw, sizeof(skw), Modbus_GetKW());

    char scfg_ov[10], scfg_uv[10], scfg_pl[10], scfg_dry_i[10], scfg_dry_i2[10];
    fmt_f1(scfg_ov,    sizeof(scfg_ov),    cfg_ov);
    fmt_f1(scfg_uv,    sizeof(scfg_uv),    cfg_uv);
    fmt_f1(scfg_pl,    sizeof(scfg_pl),    cfg_pl);
    fmt_f2(scfg_dry_i, sizeof(scfg_dry_i), cfg_dry_i);
    fmt_f2(scfg_dry_i2,sizeof(scfg_dry_i2),cfg_dry_i2);

    bool data_ok   = Modbus_IsDataValid();
    bool r1_running = relay1 && data_ok && (i > cfg_dry_i);
    bool r2_running = relay2 && data_ok && (i > cfg_dry_i2); /* relay2 uses its own threshold */

    int r3 = LoRa_GetRelay3State();  /* -1=unknown, 0=OFF, 1=ON */
    int r4 = LoRa_GetRelay4State();

