Vimalananth/STM32-EC200-Firmware/src/modem.c
    char payload[720];
    snprintf(payload, sizeof(payload),
             "{\"relay1_state\":%d,\"relay2_state\":%d,"
             "\"relay1_running\":%d,\"relay2_running\":%d,"
             "\"relay3_state\":%d,\"relay4_state\":%d,"
             "\"v1\":%s,\"v2\":%s,\"v3\":%s,"
             "\"current\":%s,\"kw\":%s,"
             "\"dry_run\":%s,\"dry_run2\":%s,\"online\":true,"
             "\"mb_ok\":%d,\"mb_rx\":%d,\"rssi\":%d,\"boot_phase\":%u,"
             "\"fw\":\"%s\","
             "\"cfg_ov\":%s,\"cfg_uv\":%s,\"cfg_pl\":%s,"
             "\"cfg_dry_i\":%s,\"cfg_dry_t\":%d,\"cfg_start_t\":%d,\"cfg_hp\":%d,\"cfg_dry_en\":%d,"
             "\"cfg_dry_i2\":%s,\"cfg_dry_t2\":%d,\"cfg_start_t2\":%d,\"cfg_hp2\":%d,\"cfg_dry_en2\":%d,"
             "\"cfg_uv_rst_t\":%d}",
             relay1 ? 1 : 0,
             relay2 ? 1 : 0,
             r1_running ? 1 : 0,
             r2_running ? 1 : 0,
             r3, r4,
             sv1, sv2, sv3, sci, skw,
             dry_run_tripped  ? "true" : "false",
             dry_run_tripped2 ? "true" : "false",
             data_ok ? 1 : 0,
             (int)Modbus_GetLastRx(),
             (int)last_rssi,
             (unsigned)g_boot_phase,
             g_fw_ver,
             scfg_ov, scfg_uv, scfg_pl,
             scfg_dry_i, cfg_dry_t, cfg_start_t, cfg_hp, cfg_dry_en,
             scfg_dry_i2, cfg_dry_t2, cfg_start_t2, cfg_hp2, cfg_dry_en2,
             cfg_uv_restart_t);

    queue_publish(TOPIC_STATUS, payload);
}

static void publish_status2(void)
{
    /* pump02 status — relay1_state maps to physical relay2 (PB4/PB5) */
    char payload[48];
    snprintf(payload, sizeof(payload),
             "{\"relay1_state\":%d,\"online\":true}",
             relay2 ? 1 : 0);
    queue_publish(TOPIC_STATUS2, payload);
}

static void publish_alert(bool ov, bool uv, bool pl, bool dr)
{
    char payload[128];
    snprintf(payload, sizeof(payload),
             "{\"overvoltage\":%s,\"undervoltage\":%s,"
             "\"phase_loss\":%s,\"dry_run_trip\":%s}",
             ov ? "true" : "false",
             uv ? "true" : "false",
             pl ? "true" : "false",
             dr ? "true" : "false");

    queue_publish(TOPIC_ALERTS, payload);
}

static void publish_alert2(bool ov, bool uv, bool pl, bool dr)
{
    char payload[128];
    snprintf(payload, sizeof(payload),
             "{\"overvoltage\":%s,\"undervoltage\":%s,"
             "\"phase_loss\":%s,\"dry_run_trip\":%s}",
             ov ? "true" : "false",
             uv ? "true" : "false",
             pl ? "true" : "false",
             dr ? "true" : "false");
    queue_publish(TOPIC_ALERTS2, payload);
}

static void RelayState_Save(void); /* forward declaration */

/* ═══════════════════════════════════════════════════════════════════════════
 * Relay log — publishes on/off events to TOPIC_LOG
 * ═══════════════════════════════════════════════════════════════════════════ */

static void log_relay_event(int relay_num, bool on, const char *reason)
{
    char payload[128];
    uint32_t *on_tick   = (relay_num == 2) ? &relay2_on_tick        : &relay1_on_tick;
    uint32_t *accum     = (relay_num == 2) ? &run_accum2_ms         : &run_accum1_ms;
    uint32_t *last_tk   = (relay_num == 2) ? &last_r2_run_tick      : &last_r1_run_tick;
    uint32_t *saved_ms  = (relay_num == 2) ? &run_accum2_saved_ms   : &run_accum1_saved_ms;
    uint64_t ts_ms = Modem_GetUnixMs(); /* 0 until network time synced */
    if (on) {
        *on_tick   = HAL_GetTick();
        *accum     = 0;   /* reset accumulator for new run session */
        *last_tk   = 0;
        *saved_ms  = 0;
        if (ts_ms)
            snprintf(payload, sizeof(payload),
                     "{\"event\":\"on\",\"reason\":\"%s\",\"relay\":%d,\"ts\":%llu}",
                     reason, relay_num, (unsigned long long)ts_ms);
        else
            snprintf(payload, sizeof(payload),
                     "{\"event\":\"on\",\"reason\":\"%s\",\"relay\":%d}", reason, relay_num);
    } else {
        /* run_s = total confirmed-running time this session.
         * Accumulator only increments when current > threshold, so preventer
         * OFF gaps (current=0) are excluded from the run time. */
        uint32_t run_s = *accum / 1000;
        *on_tick  = 0;
        *accum    = 0;
        *last_tk  = 0;
        if (ts_ms)
            snprintf(payload, sizeof(payload),
                     "{\"event\":\"off\",\"reason\":\"%s\",\"run_s\":%lu,\"relay\":%d,\"ts\":%llu}",
                     reason, (unsigned long)run_s, relay_num, (unsigned long long)ts_ms);
        else
            snprintf(payload, sizeof(payload),
                     "{\"event\":\"off\",\"reason\":\"%s\",\"run_s\":%lu,\"relay\":%d}",
                     reason, (unsigned long)run_s, relay_num);
    }
    queue_publish((relay_num == 2) ? TOPIC_LOG2 : TOPIC_LOG, payload);
    RelayState_Save();
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Protection logic  — called every 1 s when connected
 * ═══════════════════════════════════════════════════════════════════════════ */

static bool is_volt_fault(void)
{
    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    return (v1 > cfg_ov || v2 > cfg_ov || v3 > cfg_ov) ||
           (v1 < cfg_uv || v2 < cfg_uv || v3 < cfg_uv) ||
           (v1 < cfg_pl || v2 < cfg_pl || v3 < cfg_pl);
}

static void run_protection(void)
{
    static bool prev_r1_running = false;
    static bool prev_r2_running = false;

    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    float i = Sensor_ReadCurrentACS712();

    bool ov = (v1 > cfg_ov || v2 > cfg_ov || v3 > cfg_ov);
    bool uv = (v1 < cfg_uv || v2 < cfg_uv || v3 < cfg_uv);
    bool pl = (v1 < cfg_pl || v2 < cfg_pl || v3 < cfg_pl);

    /* Startup grace windows — computed once, reused for both voltage and dry-run suppression.
     * During the grace window UV+PL are ignored: motor inrush can briefly dip the supply.
     * OV protection stays active at all times (overvoltage during startup is dangerous). */
    bool relay1_in_startup = relay1_on_tick &&
        (HAL_GetTick() - relay1_on_tick < (uint32_t)cfg_start_t * 1000U);
    bool relay2_in_startup = relay2_on_tick &&
        (HAL_GetTick() - relay2_on_tick < (uint32_t)cfg_start_t2 * 1000U);

    /* OV always trips.  UV+PL only trip once the startup grace window has expired. */
    bool volt_trip1 = ov || (!relay1_in_startup && (uv || pl));
    bool volt_trip2 = ov || (!relay2_in_startup && (uv || pl));

    if (volt_trip1 && relay1)
    {
        Relay1_Set(false);
        /* Mark UV/PL trip for auto-restart — OV is dangerous, never auto-restart */
        if (!ov) { uv_pl_tripped1 = true; uv_cleared_ms1 = 0; }
        log_relay_event(1, false, ov ? "overvoltage" : (uv ? "undervoltage" : "phase_loss"));
        publish_alert(ov, uv, pl, false);
        volt_alert_sent1 = true;
        Debug_Print("[PROT] Voltage fault — pump1 OFF\r\n");
    }

