Vimalananth/STM32-EC200-Firmware/src/modem.c
    if (volt_trip2 && relay2)
    {
        Relay2_Set(false);
        if (!ov) { uv_pl_tripped2 = true; uv_cleared_ms2 = 0; }
        log_relay_event(2, false, ov ? "overvoltage" : (uv ? "undervoltage" : "phase_loss"));
        publish_alert2(ov, uv, pl, false);
        volt_alert_sent2 = true;
        Debug_Print("[PROT] Voltage fault — pump2 OFF\r\n");
    }

    /* If UV/PL dips again while we're waiting to auto-restart, reset the
     * recovery timer so the N-second count restarts from the next clear. */
    if ((uv || pl) && !ov) {
        if (uv_pl_tripped1 && uv_cleared_ms1) { uv_cleared_ms1 = 0; }
        if (uv_pl_tripped2 && uv_cleared_ms2) { uv_cleared_ms2 = 0; }
    }

    if ((ov || uv || pl) && (relay1 || relay2))
        return;

    /* Voltage OK — clear alerts and handle UV/PL auto-restart */
    if (!ov && !uv && !pl)
    {
        if (volt_alert_sent1) {
            volt_alert_sent1 = false;
            publish_alert(false, false, false, false);
            Debug_Print("[PROT] Voltage fault cleared — pump1 alert reset\r\n");
        }
        if (volt_alert_sent2) {
            volt_alert_sent2 = false;
            publish_alert2(false, false, false, false);
            Debug_Print("[PROT] Voltage fault cleared — pump2 alert reset\r\n");
        }

        /* ── UV/PL auto-restart ─────────────────────────────────────────────
         * If relay was tripped by UV/PL (not OV) and cfg_uv_restart_t > 0,
         * wait N seconds after voltage recovers then restart automatically. */
        if (uv_pl_tripped1) {
            if (relay1) {
                /* Relay was manually restarted — cancel auto-restart */
                uv_pl_tripped1 = false; uv_cleared_ms1 = 0;
            } else if (relay2) {
                /* relay2 was turned ON while relay1 was tripped — cancel
                 * auto-restart to maintain mutual exclusion (only one pump
                 * can run at a time).                                      */
                uv_pl_tripped1 = false; uv_cleared_ms1 = 0;
                Debug_Print("[PROT] UV auto-restart cancelled — pump2 active\r\n");
            } else if (cfg_uv_restart_t > 0) {
                if (uv_cleared_ms1 == 0) {
                    uv_cleared_ms1 = HAL_GetTick();
                    Debug_Print("[PROT] UV/PL cleared — auto-restart timer started\r\n");
                } else if (!dry_run_tripped &&
                           HAL_GetTick() - uv_cleared_ms1 >= (uint32_t)cfg_uv_restart_t * 1000U) {
                    uv_pl_tripped1 = false; uv_cleared_ms1 = 0;
                    Relay1_Set(true);
                    relay1_on_tick = HAL_GetTick();
                    log_relay_event(1, true, "uv_restart");
                    publish_status();
                    Debug_Print("[PROT] UV/PL auto-restart — pump1 ON\r\n");
                }
            } else {
                /* Auto-restart disabled — clear flag so it doesn't linger */
                uv_pl_tripped1 = false; uv_cleared_ms1 = 0;
            }
        }

        if (uv_pl_tripped2) {
            if (relay2) {
                uv_pl_tripped2 = false; uv_cleared_ms2 = 0;
            } else if (relay1) {
                /* relay1 was turned ON while relay2 was tripped — cancel
                 * auto-restart to maintain mutual exclusion.              */
                uv_pl_tripped2 = false; uv_cleared_ms2 = 0;
                Debug_Print("[PROT] UV auto-restart cancelled — pump1 active\r\n");
            } else if (cfg_uv_restart_t > 0) {
                if (uv_cleared_ms2 == 0) {
                    uv_cleared_ms2 = HAL_GetTick();
                    Debug_Print("[PROT] UV/PL cleared — auto-restart timer started (pump2)\r\n");
                } else if (!dry_run_tripped2 &&
                           HAL_GetTick() - uv_cleared_ms2 >= (uint32_t)cfg_uv_restart_t * 1000U) {
                    uv_pl_tripped2 = false; uv_cleared_ms2 = 0;
                    Relay2_Set(true);
                    relay2_on_tick = HAL_GetTick();
                    log_relay_event(2, true, "uv_restart");
                    publish_status();
                    Debug_Print("[PROT] UV/PL auto-restart — pump2 ON\r\n");
                }
            } else {
                uv_pl_tripped2 = false; uv_cleared_ms2 = 0;
            }
        }
    }

    /* relay1_in_startup already computed above (shared grace window for voltage + dry-run) */
    if (relay1_in_startup)
    {
        dry_run_count = 0; /* keep counter clear during startup grace */
    }
    else if (relay1 && !dry_run_tripped && cfg_dry_en)
    {
        /* i >= DRY_RUN_MIN_I_A: motor is running but drawing low current → dry run.
         * i <  DRY_RUN_MIN_I_A: motor de-energised by external preventer/timer → ignore. */
        if (i >= DRY_RUN_MIN_I_A && i < cfg_dry_i)
        {
            dry_run_count++;
            if (dry_run_count >= (uint8_t)cfg_dry_t)
            {
                dry_run_tripped = true;
                lockout_until = HAL_GetTick() + LOCKOUT_MS;
                Relay1_Set(false);
                log_relay_event(1, false, "dry_run");
                publish_alert(false, false, false, true);
                Debug_Print("[PROT] Dry run — pump OFF + lockout\r\n");
            }
        }
        else
        {
            dry_run_count = 0;
        }
    }

    if (dry_run_tripped && HAL_GetTick() >= lockout_until)
    {
        dry_run_tripped = false;
        dry_run_count = 0;
        publish_alert(false, false, false, false);
        Debug_Print("[PROT] Lockout cleared\r\n");
    }

    /* ── Relay2 dry run protection ─────────────────────────────────────── */
    /* relay2_in_startup already computed above (shared grace window for voltage + dry-run) */
    if (relay2_in_startup)
    {
        dry_run_count2 = 0;
    }
    else if (relay2 && !dry_run_tripped2 && cfg_dry_en2)
    {
        if (i >= DRY_RUN_MIN_I_A && i < cfg_dry_i2)
        {
            dry_run_count2++;
            if (dry_run_count2 >= (uint8_t)cfg_dry_t2)
            {
                dry_run_tripped2 = true;
                lockout_until2 = HAL_GetTick() + LOCKOUT_MS;
                Relay2_Set(false);
                log_relay_event(2, false, "dry_run");
                publish_alert2(false, false, false, true);
                Debug_Print("[PROT] Dry run2 — pump2 OFF + lockout\r\n");
            }
        }
        else
        {
            dry_run_count2 = 0;
        }
    }

