Vimalananth/STM32-EC200-Firmware/src/modem.c
    HAL_FLASH_Unlock();
    FLASH_EraseInitTypeDef erase = {
        .TypeErase = FLASH_TYPEERASE_PAGES,
        .Page      = RELAY_STATE_PAGE,
        .NbPages   = 1,
    };
    uint32_t page_err = 0;
    HAL_FLASHEx_Erase(&erase, &page_err);

    uint64_t buf[3];
    memcpy(buf, &s, sizeof(s));
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, RELAY_STATE_ADDR,        buf[0]);
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, RELAY_STATE_ADDR + 8U,   buf[1]);
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, RELAY_STATE_ADDR + 16U,  buf[2]);
    HAL_FLASH_Lock();
    Debug_Print("[CFG] Relay state saved to Flash\r\n");
}

static void RelayState_Load(void)
{
    const RelayState_t *p = (const RelayState_t *)RELAY_STATE_ADDR;
    if (p->magic != RELAY_STATE_MAGIC) {
        Debug_Print("[CFG] No saved relay state — defaulting OFF\r\n");
        /* Bistable relays hold position through power-loss.
         * Explicitly reset both so contacts match the expected default. */
        Relay1_Set(false);
        Relay2_Set(false);
        return;
    }
    bool r1 = p->relay1 ? true : false;
    bool r2 = (p->relay2 && !r1) ? true : false;  /* interlock: relay2 OFF if relay1 ON */

    /* Restore accumulated run time — only meaningful if relay was ON when saved.
     * Also sync the saved_ms sentinel so the first running tick does not
     * immediately trigger a redundant flash save (save_ms=0 vs accum>900 s). */
    if (r1) { run_accum1_ms = p->run_accum1_ms; run_accum1_saved_ms = p->run_accum1_ms; }
    if (r2) { run_accum2_ms = p->run_accum2_ms; run_accum2_saved_ms = p->run_accum2_ms; }

    /* Step 1: RESET both relays to a known OFF state first.
     * Bistable relays hold their mechanical position through power-loss so
     * the physical state on boot is unknown.  Resetting both guarantees a
     * clean starting point before re-applying the saved state. */
    Relay1_Set(false);
    Relay2_Set(false);

    /* Step 2: wait 500 ms before re-energising.
     * On a watchdog/software reboot the motor contactor may still be closed
     * and the motor shaft still spinning.  The delay allows the contactor
     * to fully open and the motor to coast down before the SET pulse is
     * sent, avoiding inrush current and mechanical stress on re-close. */
    HAL_Delay(500);

    /* Step 3: restore saved state — SET whichever relay was ON.
     * Record relay_on_tick so the startup grace window (UV/PL suppression)
     * applies correctly — without this, inrush dip on restore could false-trip. */
    if (r1) { Relay1_Set(true); relay1_on_tick = HAL_GetTick(); }
    if (r2) { Relay2_Set(true); relay2_on_tick = HAL_GetTick(); }
    Debug_Print("[CFG] Relay state restored from Flash\r\n");
}

/* Apply protection settings from JSON payload */
static void apply_settings(const char *json)
{
    float v;
    int   t;
    v = extract_float(json, "ov",    cfg_ov);    if (v > 0.0f) cfg_ov    = v;
    v = extract_float(json, "uv",    cfg_uv);    if (v > 0.0f) cfg_uv    = v;
    v = extract_float(json, "pl",    cfg_pl);    if (v > 0.0f) cfg_pl    = v;
    v = extract_float(json, "dry_i", cfg_dry_i); if (v > 0.0f) cfg_dry_i = v;
    t = extract_int(json, "dry_t");              if (t > 0)    cfg_dry_t = t;
    t = extract_int(json, "hp");                 if (t > 0)    cfg_hp     = t;
    if (strstr(json, "\"dry_en\":"))             cfg_dry_en = extract_int(json, "dry_en") ? 1 : 0;
    t = extract_int(json, "start_t");            if (t > 0)    cfg_start_t = t;
    if (strstr(json, "\"uv_rst\":"))            { t = extract_int(json, "uv_rst"); if (t >= 0) cfg_uv_restart_t = t; }
    Debug_Print("[CFG] Settings updated\r\n");
    publish_status(); /* reflect new cfg_ values immediately — don't wait for next heartbeat */
}

/* Apply relay2-specific settings (dry_i/dry_t/dry_en/hp only — voltage shared) */
static void apply_settings2(const char *json)
{
    float v;
    int   t;
    v = extract_float(json, "dry_i", cfg_dry_i2); if (v > 0.0f) cfg_dry_i2 = v;
    t = extract_int(json, "dry_t");               if (t > 0)    cfg_dry_t2 = t;
    t = extract_int(json, "hp");                  if (t > 0)    cfg_hp2    = t;
    if (strstr(json, "\"dry_en\":"))              cfg_dry_en2 = extract_int(json, "dry_en") ? 1 : 0;
    t = extract_int(json, "start_t");             if (t > 0)    cfg_start_t2 = t;
    Debug_Print("[CFG] Settings2 updated\r\n");
    publish_status(); /* cfg_dry_en2 is in pump01 status — publish immediately */
}

/* ═══════════════════════════════════════════════════════════════════════════
 * SMS remote control — STATUS query and hardware RESET via SMS
 * ═══════════════════════════════════════════════════════════════════════════ */

/* Forward declaration — modem_sync_expect is defined later in this file */
static bool modem_sync_expect(const char *expected, uint32_t timeout_ms);

/* Send an SMS reply to <number>.  Waits for the '>' prompt then sends text. */
static void sms_reply(const char *number, const char *text)
{
    char cmd[40];
    snprintf(cmd, sizeof(cmd), "AT+CMGS=\"%s\"", number);
    modem_cmd(cmd);
    /* Wait up to 5 s for the '>' prompt */
    uint32_t t0 = HAL_GetTick();
    bool got_prompt = false;
    while (HAL_GetTick() - t0 < 5000)
    {
        uint8_t b;
        IWDG->KR = 0xAAAAU;
        if (HAL_UART_Receive(modem_uart, &b, 1, 100) == HAL_OK && b == '>')
        {
            got_prompt = true;
            break;
        }
    }
    if (!got_prompt)
    {
        Debug_Print("[SMS] No '>' prompt — reply aborted\r\n");
        return;
    }
    HAL_UART_Transmit(modem_uart, (uint8_t *)text, strlen(text), 3000);
    uint8_t ctrlz = 0x1A;
    HAL_UART_Transmit(modem_uart, &ctrlz, 1, 1000);
    modem_sync_expect("OK", 10000); /* wait for +CMGS: / OK */
    Debug_Print("[SMS] Reply sent\r\n");
}

/* Read the stored SMS at sms_index, parse sender + body, act on command. */
static void sms_process(void)
{
    if (!sms_pending) return;
    sms_pending = false;

    /* Flush any stale UART bytes before sending AT+CMGR */
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 1) == HAL_OK) {} }

    char cmd[24];
    snprintf(cmd, sizeof(cmd), "AT+CMGR=%d", sms_index);
    modem_cmd(cmd);

