Vimalananth/STM32-EC200-Firmware/src/modem.c
            /* Force MQTT 3.1.1 right before CONNECT — version may revert to 3
             * (MQTT 3.1) between init and here, which strips credentials.    */
            modem_cmd("AT+QMTCFG=\"version\",0,4");
            HAL_Delay(500); /* wait for OK before sending CONNECT             */

            char conn_cmd[128];
            if (MQTT_USERNAME[0] != '\0')
                snprintf(conn_cmd, sizeof(conn_cmd),
                         "AT+QMTCONN=0,\"%s\",\"%s\",\"%s\"",
                         CLIENT_ID, MQTT_USERNAME, MQTT_PASSWORD);
            else
                snprintf(conn_cmd, sizeof(conn_cmd),
                         "AT+QMTCONN=0,\"%s\"", CLIENT_ID);
            /* DEBUG: print exact CONN command so credentials are visible in serial monitor */
            { char dbg2[160]; snprintf(dbg2, sizeof(dbg2), "[MQTT] >> %s\r\n", conn_cmd); Debug_Print(dbg2); }
            modem_cmd(conn_cmd);
            Debug_Print("[MQTT] Broker open (0,0) — QMTCONN sent\r\n");
        }
        else if (strstr(line, "+QMTOPEN: 0,"))
        {
            qmtopen_tls_seen = false;
            Debug_Print("[MQTT] Broker open FAILED — reconnecting\r\n");
            blink_n(1); /* 1 blink = BROKER_OPEN failed (TLS/TCP error) */
            mqtt_state = MQTT_STATE_DISCONNECTED;
        }
        if (strstr(line, "+QMTCLOSE:") || strstr(line, "+QMTSTAT:"))
        {
            /* Connection closed while waiting — restart */
            qmtopen_tls_seen = false;
            Debug_Print("[MQTT] Connection closed in BROKER_OPEN — reconnecting\r\n");
            mqtt_state = MQTT_STATE_DISCONNECTED;
        }
        if (strstr(line, "ERROR"))
        {
            qmtopen_tls_seen = false;
            Debug_Print("[MQTT] Broker open ERROR — reconnecting\r\n");
            mqtt_state = MQTT_STATE_DISCONNECTED;
        }
        break;

    /* ── waiting for +QMTCONN response ───────────────────────────────── */
    case MQTT_STATE_CONNECTING:
        if (strstr(line, "+QMTCONN:"))
        {
            /* Response formats seen in the wild:
             *   +QMTCONN: 0,0      → success (older FW, no CONNACK code)
             *   +QMTCONN: 0,0,0    → success (CONNACK=0)
             *   +QMTCONN: 0,0,5    → refused (CONNACK=5, bad credentials)
             *   +QMTCONN: 0,1,X    → packet not sent (network issue)  */
            bool conn_ok =
                (strstr(line, "+QMTCONN: 0,0,0") != NULL) ||
                /* "+QMTCONN: 0,0" with no third param (older FW) */
                (strstr(line, "+QMTCONN: 0,0") != NULL &&
                 strstr(line, "+QMTCONN: 0,0,") == NULL);

            if (conn_ok)
            {
                Debug_Print("[MQTT] Connected to HiveMQ Cloud\r\n");
                mqtt_state = MQTT_STATE_SUBSCRIBING;
                state_entered_ms = HAL_GetTick();

                char sub_cmd[64];
                snprintf(sub_cmd, sizeof(sub_cmd),
                         "AT+QMTSUB=0,1,\"%s\",1", TOPIC_CMD);
                modem_cmd(sub_cmd);
            }
            else
            {
                /* Distinguish failure codes by blink count:
                 *  2 blinks = 0,2  transport error (TCP dropped)
                 *  4 blinks = 0,0,4 bad username/password
                 *  5 blinks = 0,0,5 not authorised
                 *  6 blinks = 0,0,1/2/3 protocol/ID/server error
                 *  7 blinks = 0,1  no CONNACK / retransmission      */
                if      (strstr(line, "+QMTCONN: 0,2"))   { Debug_Print("[MQTT] CONN fail: transport error\r\n");   blink_n(2); }
                else if (strstr(line, "+QMTCONN: 0,0,4")) { Debug_Print("[MQTT] CONN fail: bad credentials\r\n");  blink_n(4); }
                else if (strstr(line, "+QMTCONN: 0,0,5")) { Debug_Print("[MQTT] CONN fail: not authorised\r\n");   blink_n(5); }
                else if (strstr(line, "+QMTCONN: 0,1"))   { Debug_Print("[MQTT] CONN fail: no CONNACK\r\n");       blink_n(7); }
                else                                       { Debug_Print("[MQTT] CONN fail: other\r\n");            blink_n(6); }
                mqtt_state = MQTT_STATE_DISCONNECTED;
            }
        }
        if (strstr(line, "ERROR"))
        {
            /* AT layer rejected the command (syntax / state error).
             * 6 fast blinks = CONN ERROR. */
            Debug_Print("[MQTT] CONN command ERROR\r\n");
            blink_n(6);
            mqtt_state = MQTT_STATE_DISCONNECTED;
        }
        break;

    /* ── waiting for +QMTSUB: 0,1,0 then 0,2,0 ──────────────────────── */
    case MQTT_STATE_SUBSCRIBING:
        if (strstr(line, "+QMTSUB: 0,1,0"))
        {
            /* cmd topic subscribed — now subscribe to OTA topic */
            Debug_Print("[MQTT] Subscribed to " TOPIC_CMD " — subscribing OTA...\r\n");
            char sub_cmd[64];
            snprintf(sub_cmd, sizeof(sub_cmd), "AT+QMTSUB=0,2,\"%s\",1", TOPIC_OTA);
            modem_cmd(sub_cmd);
        }
        if (strstr(line, "+QMTSUB: 0,2,0"))
        {
            /* OTA topic subscribed — now subscribe to settings topic */
            Debug_Print("[MQTT] Subscribed to " TOPIC_OTA " — subscribing settings...\r\n");
            char sub_cmd[64];
            snprintf(sub_cmd, sizeof(sub_cmd), "AT+QMTSUB=0,3,\"%s\",1", TOPIC_SETTINGS);
            modem_cmd(sub_cmd);
        }
        if (strstr(line, "+QMTSUB: 0,3,0"))
        {
            /* Settings topic subscribed — subscribe to pump02 cmd topic */
            Debug_Print("[MQTT] Subscribed to " TOPIC_SETTINGS " — subscribing pump02...\r\n");
            char sub_cmd[64];
            snprintf(sub_cmd, sizeof(sub_cmd), "AT+QMTSUB=0,4,\"%s\",1", TOPIC_CMD2);
            modem_cmd(sub_cmd);
        }
        if (strstr(line, "+QMTSUB: 0,4,0"))
        {
            /* pump02/cmd subscribed — now subscribe to pump02/settings */
            Debug_Print("[MQTT] Subscribed to " TOPIC_CMD2 " — subscribing settings2...\r\n");
            char sub_cmd[64];
            snprintf(sub_cmd, sizeof(sub_cmd), "AT+QMTSUB=0,5,\"%s\",1", TOPIC_SETTINGS2);
            modem_cmd(sub_cmd);
        }
        if (strstr(line, "+QMTSUB: 0,5,0"))
        {
            /* pump02/settings subscribed — subscribe to lora_ota topic */
            Debug_Print("[MQTT] Subscribed to " TOPIC_SETTINGS2 " — subscribing lora_ota...\r\n");
            char sub_cmd[64];
            snprintf(sub_cmd, sizeof(sub_cmd), "AT+QMTSUB=0,6,\"%s\",1", TOPIC_LORA_OTA);
            modem_cmd(sub_cmd);
        }
        if (strstr(line, "+QMTSUB: 0,6,0"))
        {
            /* lora_ota topic subscribed — fully connected now */
            Debug_Print("[MQTT] Subscribed to " TOPIC_LORA_OTA "\r\n");
            disconnected_count  = 0;       /* clear failure counter on successful connect */
            ota_first_reconnect = false;   /* no longer in post-OTA reconnect window      */
            blink_n(3); /* 3 blinks = MQTT fully connected! */
            HAL_IWDG_Refresh(&hiwdg);

