Vimalananth/STM32-EC200-Firmware/src/modem.c
            /* Do NOT flush here — the broker delivers any retained message
             * (e.g. pump/01/ota) immediately after subscribe.  A flush
             * loop at 115200 baud has no 1ms gap and swallows the entire
             * QMTRECV line, silently discarding the OTA trigger.
             * Just reset the partial-line buffer; stale "OK" or duplicate
             * +QMTSUB lines in CONNECTED state are harmless.               */
            rxpos = 0;
            HAL_IWDG_Refresh(&hiwdg);

            mqtt_state   = MQTT_STATE_CONNECTED;
            cclk_needed  = true; /* request network time sync on first idle slot */
            /* publish current state immediately so Firebase is up to date on connect */
            prev_relay1       = relay1;
            prev_relay2       = relay2;
            prev_dry_run_trip = dry_run_tripped;
            last_heartbeat_ms = HAL_GetTick();
            modem_cmd("AT+CSQ"); /* seed rssi before first publish */
            publish_status();
            pub_status2_needed = true; /* deferred — queue busy after publish_status() */
        }
        break;

    /* ── fully connected — handle incoming messages ───────────────────── */
    case MQTT_STATE_CONNECTED:
        /* +QMTRECV is handled globally at the top of process_line so it
         * works in any state (PUBLISHING / PUB_WAIT_OK too).  No duplicate
         * handling needed here.                                            */

        /* unsolicited disconnect */
        if (strstr(line, "+QMTSTAT:"))
        {
            Debug_Print("[MQTT] Disconnected (QMTSTAT)\r\n");
            mqtt_state = MQTT_STATE_DISCONNECTED;
        }
        break;

    /* ── waiting for '>' publish prompt ──────────────────────────────── */
    case MQTT_STATE_PUBLISHING:
        /* handled byte-by-byte in Modem_Process for '>' character */
        if (strstr(line, "ERROR"))
        {
            /* ERROR here means QMTPUBEX was rejected — connection is dead */
            Debug_Print("[MQTT] Publish prompt error — reconnecting\r\n");
            pub_pending = false;
            mqtt_state = MQTT_STATE_DISCONNECTED;
        }
        break;

    /* ── waiting for +QMTPUBEX: 0,0,0 ───────────────────────────────── */
    case MQTT_STATE_PUB_WAIT_OK:
        if (strstr(line, "+QMTPUBEX: 0,0,"))  /* any result code */
        {
            pub_pending = false;
            mqtt_state = MQTT_STATE_CONNECTED;
        }
        /* Some FW only sends "OK" for QoS=0 without a +QMTPUBEX URC */
        else if (strcmp(line, "OK") == 0)
        {
            pub_pending = false;
            mqtt_state = MQTT_STATE_CONNECTED;
        }
        if (strstr(line, "ERROR"))
        {
            Debug_Print("[MQTT] Publish failed\r\n");
            pub_pending = false;
            mqtt_state = MQTT_STATE_CONNECTED;
        }
        break;

    /* ── disconnected — will reconnect in Modem_Process ─────────────── */
    /* ── disconnected — will reconnect in Modem_Process ─────────────── */
    case MQTT_STATE_DISCONNECTED:
        break;

    /* ── SSL config — responses handled inline in Modem_Init sequence ── */
    case MQTT_STATE_SSL_CFG:
        break;
    }
}

/* Last non-empty line seen by modem_sync_expect — used in error messages */
static char modem_last_resp[64];

/* ── Synchronous line reader — polls UART until a line containing `expected`
 * is received, or ERROR, or timeout.  Returns true on match.
 * Refreshes IWDG every 1 ms so the watchdog never fires during the wait.
 * Sets modem_last_resp to the last non-empty line received (or "timeout").  */
static bool modem_sync_expect(const char *expected, uint32_t timeout_ms)
{
    char     linebuf[64];
    int      lpos = 0;
    uint32_t t0   = HAL_GetTick();
    modem_last_resp[0] = '\0';
    while (HAL_GetTick() - t0 < timeout_ms) {
        IWDG->KR = 0xAAAAU;  /* direct kick — hiwdg.Instance is NULL before MX_IWDG_Init */
        uint8_t c;
        if (HAL_UART_Receive(modem_uart, &c, 1, 1) != HAL_OK) continue;
        if (c == '\r') continue;
        if (c == '\n') {
            linebuf[lpos] = '\0';
            if (lpos > 0) {
                strncpy(modem_last_resp, linebuf, sizeof(modem_last_resp) - 1);
                modem_last_resp[sizeof(modem_last_resp) - 1] = '\0';
                /* Side-channel: save +CMTI URC even during blocking waits.
                 * Without this, a new SMS arriving during e.g. the 40s
                 * QIDEACT wait is silently lost and sms_pending never set. */
                if (strstr(linebuf, "+CMTI:")) {
                    const char *p = strrchr(linebuf, ',');
                    if (p) { sms_index = atoi(p + 1); sms_pending = true; }
                }
                if (strstr(linebuf, expected)) return true;
                if (strstr(linebuf, "ERROR"))  return false;
            }
            lpos = 0;
        } else if (lpos < (int)sizeof(linebuf) - 1) {
            linebuf[lpos++] = (char)c;
        }
    }
    strncpy(modem_last_resp, "timeout", sizeof(modem_last_resp) - 1);
    return false; /* timeout */
}

/* Drain the UART RX buffer while detecting +CMTI URCs so SMS notifications
 * received during blocking HAL_Delay / QMTCLOSE / QIDEACT windows are not
 * silently lost.  Replaces raw { while (HAL_UART_Receive...) {} } flush loops
 * in Modem_Init and the DISCONNECTED reconnect sequence.
 * byte_timeout_ms: per-byte HAL_UART_Receive timeout (1 ms = fast drain).   */
static void modem_flush_detect_cmti(uint32_t byte_timeout_ms)
{
    char lb[32]; int lp = 0;
    for (;;) {
        IWDG->KR = 0xAAAAU;
        uint8_t c;
        if (HAL_UART_Receive(modem_uart, &c, 1, byte_timeout_ms) != HAL_OK) break;
        if (c == '\r') continue;
        if (c == '\n') {
            lb[lp] = '\0';
            if (lp > 0 && strstr(lb, "+CMTI:")) {
                const char *p = strrchr(lb, ',');
                if (p) { sms_index = atoi(p + 1); sms_pending = true; }
            }
            lp = 0;
        } else if (lp < (int)sizeof(lb) - 1) {
            lb[lp++] = (char)c;
        }
    }
    rxpos = 0; /* discard any partial line in the main line buffer */
}

/* Active delay: keeps draining the UART FIFO and detecting +CMTI for the
 * full duration.  Replaces raw HAL_Delay() in all blocking AT command
 * sequences so the 8-byte hardware FIFO never overflows and SMS arrival
 * notifications (+CMTI) are never lost during MQTT reconnect windows.   */
static void modem_wait(uint32_t ms)
{
    uint32_t deadline = HAL_GetTick() + ms;
    while ((int32_t)(deadline - HAL_GetTick()) > 0)
        modem_flush_detect_cmti(1);
}

/* Poll modem for any unread SMS (AT+CMGL="REC UNREAD").
 * Called periodically as a safety net when MQTT is connected and idle,
 * catching any +CMTI that was missed during earlier blocking waits.     */
static void sms_poll_unread(void)
{
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 1) == HAL_OK) {} }
    rxpos = 0;
    modem_cmd("AT+CMGL=\"REC UNREAD\"");

