Vimalananth/STM32-EC200-Firmware/src/modem.c
        /* OTA binary passthrough — raw bytes from AT+QFREAD/QHTTPREAD */
        if (OTA_BinaryPending()) {
            OTA_FeedByte(c);
            continue;
        }

        /* LoRa OTA binary passthrough — raw bytes from AT+QFREAD during LoRa OTA */
        if (LoRaOta_BinaryPending()) {
            LoRaOta_FeedByte(c);
            continue;
        }

        if (c == '\r')
            continue;

        /* '>' is the publish prompt — not followed by '
', catch it here */
        if (c == '>')
        {
            if (mqtt_state == MQTT_STATE_PUBLISHING && pub_pending)
            {
                /* Normal path: send payload + Ctrl-Z, await +QMTPUBEX URC. */
                HAL_UART_Transmit(modem_uart,
                                  (uint8_t *)pub_payload, strlen(pub_payload), 3000);
                uint8_t ctrlz = 0x1A;
                HAL_UART_Transmit(modem_uart, &ctrlz, 1, 1000);
                pub_len_in_flight = 0; /* payload delivered, no escape needed */
                mqtt_state = MQTT_STATE_PUB_WAIT_OK;
                state_entered_ms = HAL_GetTick();
            }
            else if (mqtt_state == MQTT_STATE_DISCONNECTED && pub_len_in_flight > 0)
            {
                /* Race: +QMTSTAT: arrived before '>' was processed.
                 * EC200U is in fixed-length data mode waiting for exactly
                 * pub_len_in_flight bytes.  Send original payload + Ctrl-Z
                 * immediately so EC200U exits data mode before the reconnect
                 * block sends AT+QMTCLOSE / AT+CFUN=1,1 (otherwise those
                 * commands are swallowed as payload and never execute).     */
                HAL_UART_Transmit(modem_uart,
                                  (uint8_t *)pub_payload, pub_len_in_flight, 3000);
                uint8_t ctrlz = 0x1A;
                HAL_UART_Transmit(modem_uart, &ctrlz, 1, 1000);
                pub_len_in_flight = 0;
            }
            rxpos = 0;
            continue;
        }

        if (c == '\n')
        {
            rxbuf[rxpos] = '\0';
            if (rxpos > 0)
                process_line(rxbuf);
            rxpos = 0;
        }
        else
        {
            if (rxpos < RX_BUF_SIZE - 1)
                rxbuf[rxpos++] = (char)c;
            else
                rxpos = 0; /* overflow guard */
        }
    }

    /* Full modem reset recovery path: re-run Modem_Init so SSL/MQTT config
     * is restored before attempting any reconnect. */
    if (modem_reinit_pending && !OTA_IsActive() && !LoRaOta_IsActive()) {
        modem_reinit_pending   = false;
        recv_payload_pending   = false;
        pub_pending            = false;
        pub_status2_needed     = false;
        mqtt_offline_since_ms  = 0; /* fresh 5-min window after each reinit */
        OTA_Init();
        Modem_Init(modem_uart);
        return;
    }

    /* ── SMS remote control — works regardless of MQTT connection state ── */
    if (!OTA_IsActive())
        sms_process();

    /* ── Periodic SMS poll: safety net for +CMTI missed during blocking waits ──
     * Runs every 30 s when MQTT is connected (normal operation).
     * Also runs every 2 min when MQTT has been offline long enough that all
     * 3 auto-resets are exhausted — the board is idle so no AT command
     * conflicts.  This ensures SMS relay commands still work in the field
     * even when LTE data is down.                                            */
    if (!OTA_IsActive() && !LoRaOta_IsActive() && !sms_pending)
    {
        bool mqtt_connected = (mqtt_state == MQTT_STATE_CONNECTED);
        bool mqtt_gave_up   = (mqtt_reset_count >= MQTT_WD_MAX_RESETS &&
                               mqtt_state == MQTT_STATE_DISCONNECTED);
        if (mqtt_connected || mqtt_gave_up)
        {
            static uint32_t sms_poll_last_ms = 0;
            uint32_t interval = mqtt_connected ? 30000UL : 120000UL;
            if (HAL_GetTick() - sms_poll_last_ms > interval)
            {
                sms_poll_last_ms = HAL_GetTick();
                sms_poll_unread();
            }
        }
    }

    /* ── send AT+QIACT=1 after buffer is drained (avoids stale QMTCLOSE/QIDEACT OK) ── */
    if (mqtt_state == MQTT_STATE_PDP_ACTIVATE && !qiact_sent)
    {
        qiact_sent = true;
        modem_cmd("AT+QIACT=1");
    }

    /* ── send AT+QICSGP after buffer is drained (avoids spurious CGREG OK) ── */
    if (mqtt_state == MQTT_STATE_PDP_OPEN && !qicsgp_sent)
    {
        qicsgp_sent = true;
        char apn_cmd[80];
        snprintf(apn_cmd, sizeof(apn_cmd),
                 "AT+QICSGP=1,1,\"%s\",\"\",\"\",0", SIM_APN);
        modem_cmd(apn_cmd);
    }

    /* ── BOOT heartbeat: keep probing modem until first RDY/OK is seen ── */
    if (mqtt_state == MQTT_STATE_BOOT &&
        (HAL_GetTick() - state_entered_ms) > 3000U)
    {
        Debug_Print("[MODEM] BOOT probe: AT\r\n");
        modem_cmd("AT");
        state_entered_ms = HAL_GetTick();
    }

    /* ── BROKER_OPEN / CONNECTING / SUBSCRIBING timeouts → reconnect ── */
    if ((mqtt_state == MQTT_STATE_BROKER_OPEN ||
         mqtt_state == MQTT_STATE_CONNECTING  ||
         mqtt_state == MQTT_STATE_SUBSCRIBING) &&
        HAL_GetTick() - state_entered_ms > 30000)
    {
        Debug_Print("[MQTT] Connection timeout — reconnecting\r\n");
        if (mqtt_state == MQTT_STATE_BROKER_OPEN) blink_n(1); /* 1 blink = BROKER_OPEN timed out */
        mqtt_state = MQTT_STATE_DISCONNECTED;
    }

    /* ── PUBLISHING timeout — no '>' within 10s means connection is dead ── */
    if (mqtt_state == MQTT_STATE_PUBLISHING &&
        HAL_GetTick() - state_entered_ms > 10000)
    {
        Debug_Print("[MQTT] Publish timeout — reconnecting\r\n");
        pub_pending = false;
        mqtt_state = MQTT_STATE_DISCONNECTED;
    }

    /* ── PUB_WAIT_OK timeout — if +QMTPUBEX never arrives, back to CONNECTED ── */
    if (mqtt_state == MQTT_STATE_PUB_WAIT_OK &&
        HAL_GetTick() - state_entered_ms > MQTT_PUBACK_TIMEOUT_MS)
    {
        Debug_Print("[MQTT] PubWaitOK timeout — continuing\r\n");
        pub_pending = false;
        mqtt_state = MQTT_STATE_CONNECTED;
    }

