Vimalananth/STM32-EC200-Firmware/src/modem.c
    /* ── periodic tasks (only when fully connected) ── */
    if (mqtt_state == MQTT_STATE_CONNECTED && !OTA_IsActive() && !LoRaOta_IsActive())
    {

        /* Network time sync — request AT+CCLK? once after connect, then every 6h */
        if (!pub_pending &&
            (cclk_needed ||
             (last_cclk_ms && HAL_GetTick() - last_cclk_ms >= CCLK_RESYNC_MS)))
        {
            cclk_needed = false;
            modem_cmd("AT+CCLK?");
        }

        /* Deferred pump02 status — send as soon as the queue is free */
        if (pub_status2_needed && !pub_pending)
        {
            pub_status2_needed = false;
            publish_status2();
        }

        /* publish on state change — relay or dry-run trip changed */
        if (!pub_pending &&
            (relay1 != prev_relay1 || relay2 != prev_relay2 ||
             dry_run_tripped != prev_dry_run_trip))
        {
            bool relay2_changed = (relay2 != prev_relay2);
            prev_relay1       = relay1;
            prev_relay2       = relay2;
            prev_dry_run_trip = dry_run_tripped;
            publish_status();
            if (relay2_changed) pub_status2_needed = true; /* deferred — queue busy */
        }

        /* heartbeat every 60 s — keeps Firebase online:true fresh */
        if (HAL_GetTick() - last_heartbeat_ms >= HEARTBEAT_INTERVAL_MS)
        {
            last_heartbeat_ms = HAL_GetTick();
            modem_cmd("AT+CSQ"); /* refresh signal strength; +CSQ updates last_rssi */
            publish_status();
            pub_status2_needed = true; /* deferred — queue busy after publish_status() */
        }

        /* LoRa slave_status — set() every 60 s (online or offline) */
        if (HAL_GetTick() - lora_log_last_ms >= LORA_LOG_INTERVAL_MS)
        {
            lora_log_last_ms = HAL_GetTick();
            uint32_t age_raw = LoRa_GetLastRcvAge();
            uint64_t ts      = Modem_GetUnixMs();

            if (age_raw == 0xFFFFFFFFUL || age_raw / 1000 > 120)
            {
                /* Slave offline — publish minimal offline status */
                char off_st[48];
                if (ts)
                    snprintf(off_st, sizeof(off_st),
                             "{\"online\":false,\"ts\":%llu}", (unsigned long long)ts);
                else
                    snprintf(off_st, sizeof(off_st), "{\"online\":false}");
                queue_publish(TOPIC_SLAVE_STATUS, off_st);
            }
            else
            {
                /* Slave online — build full status */
                uint32_t age_s  = age_raw / 1000;
                uint32_t fl_x10 = LoRa_GetFlowLpmX10();
                uint32_t tv_l   = LoRa_GetTotalLitresInt();
                char slave_st[320];
                int slen = snprintf(slave_st, sizeof(slave_st),
                             "{\"online\":true,\"relay\":%d"
                             ",\"rssi\":%d,\"snr\":%d,\"age_s\":%lu"
                             ",\"fl\":%lu.%lu,\"tv\":%lu",
                             (LoRa_GetRelay3State() == 1) ? 1 : 0,
                             LoRa_GetLastRSSI(), LoRa_GetLastSNR(),
                             (unsigned long)age_s,
                             (unsigned long)(fl_x10 / 10U),
                             (unsigned long)(fl_x10 % 10U),
                             (unsigned long)tv_l);
                if (LoRa_IsModbusValid() && slen > 0 && slen < (int)sizeof(slave_st) - 120)
                    slen += snprintf(slave_st + slen, sizeof(slave_st) - (size_t)slen,
                             ",\"v1\":%ld.%ld,\"v2\":%ld.%ld,\"v3\":%ld.%ld"
                             ",\"i1\":%ld.%02ld,\"i2\":%ld.%02ld,\"i3\":%ld.%02ld"
                             ",\"kw\":%ld.%ld,\"kwh\":%lu",
                             (long)(LoRa_GetV1x10()  / 10), (long)(LoRa_GetV1x10()  % 10),
                             (long)(LoRa_GetV2x10()  / 10), (long)(LoRa_GetV2x10()  % 10),
                             (long)(LoRa_GetV3x10()  / 10), (long)(LoRa_GetV3x10()  % 10),
                             (long)(LoRa_GetI1x100() / 100),(long)(LoRa_GetI1x100() % 100),
                             (long)(LoRa_GetI2x100() / 100),(long)(LoRa_GetI2x100() % 100),
                             (long)(LoRa_GetI3x100() / 100),(long)(LoRa_GetI3x100() % 100),
                             (long)(LoRa_GetKWx10()  / 10), (long)(LoRa_GetKWx10()  % 10),
                             (unsigned long)LoRa_GetKWh());
                if (ts && slen > 0 && slen < (int)sizeof(slave_st) - 25)
                    snprintf(slave_st + slen, sizeof(slave_st) - (size_t)slen,
                             ",\"ts\":%llu}", (unsigned long long)ts);
                else if (slen > 0 && slen < (int)sizeof(slave_st) - 2)
                    slave_st[slen] = '}', slave_st[slen + 1] = '\0';
                queue_publish(TOPIC_SLAVE_STATUS, slave_st);
            }
        }

        /* LoRa slave voltage log — push every 5 min when Modbus valid */
        static uint32_t slave_vlog_last_ms = 0;
        if (HAL_GetTick() - slave_vlog_last_ms >= 300000U && LoRa_IsModbusValid())
        {
            slave_vlog_last_ms = HAL_GetTick();
            uint64_t ts = Modem_GetUnixMs();
            char slave_vl[192];
            int vlen = snprintf(slave_vl, sizeof(slave_vl),
                         "{\"v1\":%ld.%ld,\"v2\":%ld.%ld,\"v3\":%ld.%ld"
                         ",\"i1\":%ld.%02ld,\"i2\":%ld.%02ld,\"i3\":%ld.%02ld"
                         ",\"kw\":%ld.%ld",
                         (long)(LoRa_GetV1x10()  / 10), (long)(LoRa_GetV1x10()  % 10),
                         (long)(LoRa_GetV2x10()  / 10), (long)(LoRa_GetV2x10()  % 10),
                         (long)(LoRa_GetV3x10()  / 10), (long)(LoRa_GetV3x10()  % 10),
                         (long)(LoRa_GetI1x100() / 100),(long)(LoRa_GetI1x100() % 100),
                         (long)(LoRa_GetI2x100() / 100),(long)(LoRa_GetI2x100() % 100),
                         (long)(LoRa_GetI3x100() / 100),(long)(LoRa_GetI3x100() % 100),
                         (long)(LoRa_GetKWx10()  / 10), (long)(LoRa_GetKWx10()  % 10));
            if (ts && vlen > 0 && vlen < (int)sizeof(slave_vl) - 25)
                snprintf(slave_vl + vlen, sizeof(slave_vl) - (size_t)vlen,
                         ",\"ts\":%llu}", (unsigned long long)ts);
            else if (vlen > 0 && vlen < (int)sizeof(slave_vl) - 2)
                slave_vl[vlen] = '}', slave_vl[vlen + 1] = '\0';
            queue_publish(TOPIC_SLAVE_VLOG, slave_vl);
        }

        /* run protection every 1 s */
        static uint32_t last_prot_ms = 0;
        if (HAL_GetTick() - last_prot_ms >= 1000)
        {
            last_prot_ms = HAL_GetTick();
            run_protection();
        }
    }

    /* ── send OTA error (saved across reconnect) as soon as MQTT is up ── */
    if (ota_error_msg[0] && mqtt_state == MQTT_STATE_CONNECTED)
    {
        pub_pending = false; /* prioritize OTA result over queued heartbeat */
        queue_publish(TOPIC_OTA_STATUS, ota_error_msg);
        ota_error_msg[0] = '\0';
        force_status_after_ota = true;
    }

    if (force_status_after_ota &&
        mqtt_state == MQTT_STATE_CONNECTED &&
        !OTA_IsActive() &&
        !pub_pending)
    {
        modem_cmd("AT+CSQ");
        publish_status();
        force_status_after_ota = false;
    }

