Vimalananth/STM32-EC200-Firmware/src/modem.c
    /* Feed once more after draining RX loop. */
    HAL_IWDG_Refresh(&hiwdg);

    /* ── send queued publish when connected and idle (not during OTA) ── */
    if (pub_pending && mqtt_state == MQTT_STATE_CONNECTED && !OTA_IsActive() && !LoRaOta_IsActive())
    {
        char pub_cmd[128];
        snprintf(pub_cmd, sizeof(pub_cmd),
                 "AT+QMTPUBEX=0,0,0,0,\"%s\",%d",  /* QoS=0: msgID must be 0 */
                 pub_topic, (int)strlen(pub_payload));
        pub_len_in_flight = strlen(pub_payload); /* record N for data-mode escape */
        modem_cmd(pub_cmd);
        mqtt_state = MQTT_STATE_PUBLISHING;
        state_entered_ms = HAL_GetTick();
    }

    /* ── auto-reconnect (not during OTA — would disrupt HTTP download) ── */
    if (mqtt_state == MQTT_STATE_DISCONNECTED && !OTA_IsActive() && !LoRaOta_IsActive())
    {
        static uint32_t last_reconnect = 0;
        if (HAL_GetTick() - last_reconnect > 10000)
        {
            last_reconnect = HAL_GetTick();
            state_entered_ms = HAL_GetTick();
            /* Refresh IWDG immediately — blink_n(5/6/7) may have consumed up to
             * 3800ms before setting DISCONNECTED, leaving < 200ms until timeout. */
            HAL_IWDG_Refresh(&hiwdg);
            pub_len_in_flight = 0; /* abandon in-flight publish; '>' no longer expected */
            qmtopen_tls_seen = false;
            disconnected_count++;

            /* ── Escape any pending AT+QMTPUBEX data mode ──────────────────
             * Race: if +QMTSTAT: arrived before the '>' prompt was processed,
             * mqtt_state flipped to DISCONNECTED without ever sending the
             * payload/Ctrl-Z.  EC200U sent '>' and is still waiting for N
             * payload bytes; every AT command we send is consumed as payload
             * data and eventually published as garbage to the broker.
             * Ctrl-Z (0x1A) exits data mode in all EC200U modes:
             *   • in data mode  → commits a zero/partial publish (connection
             *     is dead anyway) and exits to command mode
             *   • in command mode → harmless noise / ignored                */
            { uint8_t esc = 0x1A; HAL_UART_Transmit(modem_uart, &esc, 1, 100); }
            modem_wait(200);
            modem_flush_detect_cmti(200);
            HAL_IWDG_Refresh(&hiwdg);

            /* ── Nuclear option: CFUN hard reset on persistent failure ── *
             * After an OTA reboot: fire after 1 failure (TLS heap may still    *
             * be dirty from HTTPS download; CFUN is the only reliable fix).    *
             * Normal operation: fire after 5 failures (~4 min of retries).     *
             * AT+CFUN=1,1 is the only way to fully clear EC200U TLS heap.      */
            int nuclear_threshold = ota_first_reconnect ? 0 : 5;
            if (disconnected_count > nuclear_threshold)
            {
                disconnected_count  = 0;
                ota_first_reconnect = false; /* reset post-OTA flag */
                Debug_Print("[MQTT] DISCONNECTED nuclear — CFUN hard reset\r\n");
                modem_cmd("AT+CFUN=1,1");
                if (!modem_sync_expect("APP RDY", 60000))
                    Debug_Print("[MQTT] CFUN APP RDY timeout\r\n");
                modem_wait(10000); /* 10 s settle — keeps FIFO drained, detects +CMTI */
                modem_flush_detect_cmti(100);
                IWDG->KR = 0xAAAAU;
                modem_reinit_pending = true;
                mqtt_state = MQTT_STATE_BOOT;
                return; /* Modem_Process will call Modem_Init on next call */
            }

            Debug_Print("[MQTT] Reconnecting...\r\n");
            /* Stop any active HTTP session BEFORE closing MQTT and deactivating
             * the PDP bearer.  After a failed OTA, the HTTP context may still be
             * "open" (QHTTPCFG configured, partial QHTTPURL).  AT+QIDEACT fails
             * silently when an HTTP session is active, leaving the PDP in a bad
             * state and preventing MQTT from ever reconnecting.
             * Modem_Init already does this; we must mirror it here.            */
            modem_cmd("AT+QHTTPSTOP");
            modem_wait(500);
            HAL_IWDG_Refresh(&hiwdg);
            modem_cmd("AT+QMTCLOSE=0");
            modem_wait(1500);
            HAL_IWDG_Refresh(&hiwdg);
            /* Flush URCs from QMTCLOSE; detect +CMTI so SMS is not lost. */
            modem_flush_detect_cmti(1);
            /* Re-apply full MQTT config after QMTCLOSE — QMTCLOSE reloads NVM
             * which resets version (3.1 → strips credentials), ssl (disabled),
             * pdpcid, session, and recv/mode to factory defaults.             */
            modem_cmd("AT+QMTCFG=\"version\",0,4");    /* MQTT 3.1.1           */
            modem_wait(300);
            modem_cmd("AT+QMTCFG=\"will\",0,0");
            modem_wait(300);
            modem_cmd("AT+QMTCFG=\"ssl\",0,1,0");      /* MQTT ctx 0 → SSL 0   */
            modem_wait(300);
            modem_cmd("AT+QMTCFG=\"pdpcid\",0,1");     /* MQTT ctx 0 → PDP 1   */
            modem_wait(300);
            modem_cmd("AT+QMTCFG=\"session\",0,1");    /* clean session        */
            modem_wait(300);
            modem_cmd("AT+QMTCFG=\"recv/mode\",0,1,1"); /* push + full payload */
            modem_wait(300);
            HAL_IWDG_Refresh(&hiwdg);
            modem_cmd("AT+QIDEACT=1");
            modem_wait(1500);
            HAL_IWDG_Refresh(&hiwdg);
            /* Flush URCs from QIDEACT; detect +CMTI so SMS is not lost. */
            modem_flush_detect_cmti(1);
            recv_payload_pending = false; /* clear stale recv state           */
            pub_pending          = false; /* drop unsent publish              */
            /* Re-apply SSL context 0 after QMTCLOSE — NVM reload may have
             * reset seclevel/ciphersuite/SNI back to factory defaults,
             * causing TLS handshake to fail when QMTOPEN is sent.          */
            modem_cmd("AT+QSSLCFG=\"sslversion\",0,4");
            modem_wait(300);
            HAL_IWDG_Refresh(&hiwdg);
            modem_cmd("AT+QSSLCFG=\"ciphersuite\",0,0xFFFF");
            modem_wait(300);
            HAL_IWDG_Refresh(&hiwdg);
            modem_cmd("AT+QSSLCFG=\"seclevel\",0,0");
            modem_wait(300);
            HAL_IWDG_Refresh(&hiwdg);
            modem_cmd("AT+QSSLCFG=\"sni\",0,\"" BROKER_HOST "\"");
            modem_wait(300);
            HAL_IWDG_Refresh(&hiwdg);
            /* APN already configured — skip QICSGP, go straight to QIACT.
             * Modem_Process sends AT+QIACT=1 after the buffer is drained
             * so stale OK from QMTCLOSE/QIDEACT above is not misread.      */
            mqtt_state       = MQTT_STATE_PDP_ACTIVATE;
            qiact_sent       = false;
            qiact_retry_done = false; /* fresh attempt — PDP just deactivated */
        }
    }

    /* ── net registration timeout — retry both GPRS and LTE ── */
    /* This block runs every Modem_Process iteration (not just on line receipt)
     * so the 3-min timeout fires even when the modem sends no responses.    */
    if (mqtt_state == MQTT_STATE_NET_WAIT &&
        HAL_GetTick() - state_entered_ms > 5000)
    {
        state_entered_ms = HAL_GetTick();
        net_wait_tries++;
        if (net_wait_tries > 36) {
            net_wait_tries = 0;
            Debug_Print("[NET] NET_WAIT timeout (3 min) — forcing reconnect\r\n");
            mqtt_state = MQTT_STATE_DISCONNECTED;
        } else {
            modem_cmd("AT+CGREG?");
            HAL_Delay(200);
            modem_cmd("AT+CEREG?");
        }
    }

    /* ── MQTT offline backoff watchdog ────────────────────────────────────────
     * Reset #1: after 2 min offline (this boot)
     * Reset #2: after 30 min offline (next boot)
     * Reset #3: after 1 hour offline (next boot)
     * After 3 resets: give up — wait for manual power cycle.
     * Reset count survives NVIC_SystemReset() via RTC BKP0R.
     * Suppressed during OTA so an in-progress download is not aborted.    */
    if (!OTA_IsActive() && !LoRaOta_IsActive())
    {
        bool mqtt_active = (mqtt_state == MQTT_STATE_CONNECTED  ||
                            mqtt_state == MQTT_STATE_PUBLISHING ||
                            mqtt_state == MQTT_STATE_PUB_WAIT_OK);
        if (mqtt_active)
        {
            mqtt_offline_since_ms = 0;
            if (mqtt_reset_count > 0)
            {
                bkup_clear_reset_count();
                mqtt_reset_count = 0;
            }
        }
        else if (mqtt_offline_since_ms == 0)
        {
            mqtt_offline_since_ms = HAL_GetTick();
        }
        else if (mqtt_reset_count < MQTT_WD_MAX_RESETS)
        {
            if (HAL_GetTick() - mqtt_offline_since_ms >
                MQTT_WD_DELAY_MS[mqtt_reset_count])
            {
                char msg[64];
                snprintf(msg, sizeof(msg),
                         "[MQTT] offline watchdog reset #%u/%u\r\n",
                         (unsigned)(mqtt_reset_count + 1U),
                         (unsigned)MQTT_WD_MAX_RESETS);
                Debug_Print(msg);
                bkup_set_reset_count(mqtt_reset_count + 1U);
                IWDG->KR = 0xAAAAU;
                NVIC_SystemReset();
            }
        }
        else
        {
            static bool gave_up_logged = false;
            if (!gave_up_logged)
            {
                Debug_Print("[MQTT] 3 resets exhausted — manual power cycle required\r\n");
                gave_up_logged = true;
            }
        }
    }

    /* ── MQTT offline relay management ────────────────────────────────────────
     * When MQTT goes offline: save relay states, turn both OFF, write OFF to
     * Flash so reboots also start with relays off.
     * When MQTT comes back online: restore saved relay states from .noinit RAM
     * and write restored state to Flash.                                     */
    {
        bool mqtt_active = (mqtt_state == MQTT_STATE_CONNECTED  ||
                            mqtt_state == MQTT_STATE_PUBLISHING ||
                            mqtt_state == MQTT_STATE_PUB_WAIT_OK);
        static bool mqtt_prev_active = false;

        if (!mqtt_prev_active && mqtt_active)
        {
            /* MQTT just reconnected — restore saved relay state */
            bool offline_valid = (noinit_offline_magic  == OFFLINE_RELAY_MAGIC) &&
                                 (noinit_offline_relay1 <= 1U) &&
                                 (noinit_offline_relay2 <= 1U);
            if (offline_valid)
            {
                bool r1 = (noinit_offline_relay1 != 0U);
                bool r2 = (noinit_offline_relay2 != 0U);
                noinit_offline_magic = 0U;          /* clear saved state     */
                Debug_Print("[MQTT] online — restoring relay states\r\n");
                if (r1) { Relay1_Set(true);  relay1_on_tick = HAL_GetTick(); }
                if (r2) { Relay2_Set(true);  relay2_on_tick = HAL_GetTick(); }
                RelayState_Save();                  /* update Flash          */
            }
        }
        else if (mqtt_prev_active && !mqtt_active)
        {
            /* MQTT just went offline — save relay states and turn both OFF  */
            noinit_offline_relay1 = relay1 ? 1U : 0U;
            noinit_offline_relay2 = relay2 ? 1U : 0U;
            noinit_offline_magic  = OFFLINE_RELAY_MAGIC;
            if (relay1 || relay2)
            {
                Debug_Print("[MQTT] offline — turning relays OFF\r\n");
                Relay1_Set(false);
                Relay2_Set(false);
                RelayState_Save();   /* write OFF to Flash — survives reboot */
            }
        }
        mqtt_prev_active = mqtt_active;
    }
}


